{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('e9618345-072d-4f0c-ba78-7eabf27eea02')/settings(settingDefinitions())",
    "@odata.count": 6,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "Pol_MSS_AutoAdminLogon",
                        "MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended)",
                        "\\MSS (Legacy)",
                        "Administrative Templates\\MSS (Legacy)",
                        "MSS (Legacy)",
                        "MSS: (AutoAdminLogon) Enable Automatic Logon",
                        "Machine",
                        "Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon",
                        "AutoAdminLogon"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-admx-mss-legacy#admx-mss-legacy-pol-mss-autoadminlogon"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/ADMX_MSS-legacy/Pol_MSS_AutoAdminLogon",
                    "rootDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon",
                    "categoryId": "e00ff1f8-a2d1-4d3b-bb07-f58b38b8d5d7",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon",
                    "description": "MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended)\n ",
                    "helpText": "",
                    "name": "Pol_MSS_AutoAdminLogon",
                    "displayName": "MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended)",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "10.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.19041.1202",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_autoadminlogon_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordhistory",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 24
                            }
                        }
                    ]
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "DevicePasswordEnabled",
                        "DeviceLock",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#devicepasswordenabled"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/DevicePasswordEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "description": "Specifies whether device lock is enabled.",
                    "helpText": "",
                    "name": "DevicePasswordEnabled",
                    "displayName": "Device Password Enabled",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": [
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_allowidlereturnwithoutpassword",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_devicepasswordexpiration",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_devicepasswordhistory",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_maxdevicepasswordfailedattempts",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelock",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                                    "required": false
                                },
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_mindevicepasswordlength",
                                    "required": false
                                }
                            ]
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_1",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Device Password Expiration",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#devicepasswordexpiration"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/DevicePasswordExpiration",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_devicepasswordexpiration",
                    "description": "Specifies when the password expires (in days). 0 - Passwords do not expire.",
                    "helpText": "",
                    "name": "DevicePasswordExpiration",
                    "displayName": "Device Password Expiration",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 730,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Min Device Password Length",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#mindevicepasswordlength"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/MinDevicePasswordLength",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_mindevicepasswordlength",
                    "description": "Specifies the minimum number or characters required in the PIN or password.",
                    "helpText": "",
                    "name": "MinDevicePasswordLength",
                    "displayName": "Min Device Password Length",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 16,
                        "minimumValue": 4
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 4
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Max Device Password Failed Attempts",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#maxdevicepasswordfailedattempts"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/MaxDevicePasswordFailedAttempts",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_maxdevicepasswordfailedattempts",
                    "description": "On a desktop, when the user reaches the value set by this policy, it is not wiped. Instead, the desktop is put on BitLocker recovery mode, which makes the data inaccessible but recoverable. If BitLocker is not enabled, then the policy cannot be enforced.",
                    "helpText": "",
                    "name": "MaxDevicePasswordFailedAttempts",
                    "displayName": "Max Device Password Failed Attempts",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 999,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Alphanumeric Device Password Required",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#alphanumericdevicepasswordrequired"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/AlphanumericDevicePasswordRequired",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired",
                    "description": "Determines the type of PIN or password required. This policy only applies if the DeviceLock/DevicePasswordEnabled policy is set to 0",
                    "helpText": "",
                    "name": "AlphanumericDevicePasswordRequired",
                    "displayName": "Alphanumeric Device Password Required",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_2",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                            "description": "Password or Alphanumeric PIN required.",
                            "helpText": null,
                            "name": "Password or Alphanumeric PIN required.",
                            "displayName": "Password or Alphanumeric PIN required.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                }
                            ],
                            "dependedOnBy": [
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                                    "required": false
                                }
                            ]
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_1",
                            "description": "Password or Numeric PIN required.",
                            "helpText": null,
                            "name": "Password or Numeric PIN required.",
                            "displayName": "Password or Numeric PIN required.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_2",
                            "description": "Password, Numeric PIN, or Alphanumeric PIN required.",
                            "helpText": null,
                            "name": "Password, Numeric PIN, or Alphanumeric PIN required.",
                            "displayName": "Password, Numeric PIN, or Alphanumeric PIN required.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Min Device Password Complex Characters",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#mindevicepasswordcomplexcharacters"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/MinDevicePasswordComplexCharacters",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                    "description": "The number of complex element types (uppercase and lowercase letters, numbers, and punctuation) required for a strong PIN or password.",
                    "helpText": "",
                    "name": "MinDevicePasswordComplexCharacters",
                    "displayName": "Min Device Password Complex Characters",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_1",
                            "description": "Digits only",
                            "helpText": null,
                            "name": "Digits only",
                            "displayName": "Digits only",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                },
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_2",
                            "description": "Digits and lowercase letters are required",
                            "helpText": null,
                            "name": "Digits and lowercase letters are required",
                            "displayName": "Digits and lowercase letters are required",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                },
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_3",
                            "description": "Digits lowercase letters and uppercase letters are required. Not supported in desktop Microsoft accounts and domain accounts",
                            "helpText": null,
                            "name": "Digits lowercase letters and uppercase letters are required. Not supported in desktop Microsoft accounts and domain accounts",
                            "displayName": "Digits lowercase letters and uppercase letters are required. Not supported in desktop Microsoft accounts and domain accounts",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                },
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_4",
                            "description": "Digits lowercase letters uppercase letters and special characters are required. Not supported in desktop",
                            "helpText": null,
                            "name": "Digits lowercase letters uppercase letters and special characters are required. Not supported in desktop",
                            "displayName": "Digits lowercase letters uppercase letters and special characters are required. Not supported in desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 4
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                },
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Max Inactivity Time Device Lock",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#maxinactivitytimedevicelock"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/MaxInactivityTimeDeviceLock",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelock",
                    "description": "Specifies the maximum amount of time (in minutes) allowed after the device is idle that will cause the device to become PIN or password locked. Users can select any existing timeout value less than the specified maximum time in the Settings app. 0 - No timeout is defined",
                    "helpText": "",
                    "name": "MaxInactivityTimeDeviceLock",
                    "displayName": "Max Inactivity Time Device Lock",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 999,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Device Password History",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#devicepasswordhistory"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/DevicePasswordHistory",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_devicepasswordhistory",
                    "description": "Specifies how many passwords can be stored in the history that can’t be used.",
                    "helpText": "",
                    "name": "DevicePasswordHistory",
                    "displayName": "Device Password History",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 50,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                            "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Allow Simple Device Password",
                        "Device Lock"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-devicelock#allowsimpledevicepassword"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceLock/AllowSimpleDevicePassword",
                    "rootDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "categoryId": "a4fb2510-977f-42ff-9033-6f1eb98f141b",
                    "settingUsage": "configuration,compliance",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword",
                    "description": "Specifies whether PINs or passwords such as 1111 or 1234 are allowed. For the desktop, it also controls the use of picture passwords.",
                    "helpText": "",
                    "name": "AllowSimpleDevicePassword",
                    "displayName": "Allow Simple Device Password",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10240",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword_0",
                            "description": "Not allowed.",
                            "helpText": null,
                            "name": "Not allowed.",
                            "displayName": "Not allowed.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword_1",
                            "description": "Allowed.",
                            "helpText": null,
                            "name": "Allowed.",
                            "displayName": "Allowed.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                                    "parentSettingId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetextforusersattemptingtologon",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingCollectionValue": [
                    {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": "Insert text here"
                    }
                ]
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Message Text For Users Attempting To Log On",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_messagetextforusersattemptingtologon"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_MessageTextForUsersAttemptingToLogOn",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetextforusersattemptingtologon",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetextforusersattemptingtologon",
                    "description": "Interactive logon: Message text for users attempting to log on  This security setting specifies a text message that is displayed to users when they log on.  This text is often used for legal reasons, for example, to warn users about the ramifications of misusing company information or to warn them that their actions may be audited.  Default: No message.",
                    "helpText": "",
                    "name": "InteractiveLogon_MessageTextForUsersAttemptingToLogOn",
                    "displayName": "Interactive Logon Message Text For Users Attempting To Log On",
                    "version": "639094788176414916",
                    "maximumCount": 1000,
                    "minimumCount": 0,
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 87516,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": null
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetitleforusersattemptingtologon",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "Enter title here"
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Message Title For Users Attempting To Log On",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_messagetitleforusersattemptingtologon"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_MessageTitleForUsersAttemptingToLogOn",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetitleforusersattemptingtologon",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetitleforusersattemptingtologon",
                    "description": "Interactive logon: Message title for users attempting to log on  This security setting allows the specification of a title to appear in the title bar of the window that contains the Interactive logon: Message text for users attempting to log on.  Default: No message.",
                    "helpText": "",
                    "name": "InteractiveLogon_MessageTitleForUsersAttemptingToLogOn",
                    "displayName": "Interactive Logon Message Title For Users Attempting To Log On",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 87516,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": null
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Behavior Of The Elevation Prompt For Administrators",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_behavioroftheelevationpromptforadministrators"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_BehaviorOfTheElevationPromptForAdministrators",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                    "description": "User Account Control: Behavior of the elevation prompt for administrators in Admin Approval Mode  This policy setting controls the behavior of the elevation prompt for administrators.  The options are:  • Elevate without prompting: Allows privileged accounts to perform an operation that requires elevation without requiring consent or credentials. Note: Use this option only in the most constrained environments.  • Prompt for credentials on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to enter a privileged user name and password. If the user enters valid credentials, the operation continues with the user's highest available privilege.  • Prompt for consent on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.  • Prompt for credentials: When an operation requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.  • Prompt for consent: When an operation requires elevation of privilege, the user is prompted to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.  • Prompt for consent for non-Windows binaries: (Default) When an operation for a non-Microsoft application requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.",
                    "helpText": "",
                    "name": "UserAccountControl_BehaviorOfTheElevationPromptForAdministrators",
                    "displayName": "User Account Control Behavior Of The Elevation Prompt For Administrators",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_5",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_0",
                            "description": "Elevate without prompting",
                            "helpText": null,
                            "name": "Elevate without prompting",
                            "displayName": "Elevate without prompting",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_1",
                            "description": "Prompt for credentials on the secure desktop",
                            "helpText": null,
                            "name": "Prompt for credentials on the secure desktop",
                            "displayName": "Prompt for credentials on the secure desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_2",
                            "description": "Prompt for consent on the secure desktop",
                            "helpText": null,
                            "name": "Prompt for consent on the secure desktop",
                            "displayName": "Prompt for consent on the secure desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_3",
                            "description": "Prompt for credentials",
                            "helpText": null,
                            "name": "Prompt for credentials",
                            "displayName": "Prompt for credentials",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_4",
                            "description": "Prompt for consent",
                            "helpText": null,
                            "name": "Prompt for consent",
                            "displayName": "Prompt for consent",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 4
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_5",
                            "description": "Prompt for consent for non-Windows binaries",
                            "helpText": null,
                            "name": "Prompt for consent for non-Windows binaries",
                            "displayName": "Prompt for consent for non-Windows binaries",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 5
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Hypervisor Enforced Code Integrity",
                        "Virtualization Based Technology"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-VirtualizationBasedTechnology#hypervisorenforcedcodeintegrity"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/VirtualizationBasedTechnology/HypervisorEnforcedCodeIntegrity",
                    "rootDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                    "categoryId": "3588f84a-69de-4900-910c-09a5b69e5d99",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                    "description": "Hypervisor-Protected Code Integrity: 0 - Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock, 1 - Turns on Hypervisor-Protected Code Integrity with UEFI lock, 2 - Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                    "helpText": "",
                    "name": "HypervisorEnforcedCodeIntegrity",
                    "displayName": "Hypervisor Enforced Code Integrity",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "11.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.22000",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_0",
                            "description": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "helpText": null,
                            "name": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "displayName": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_1",
                            "description": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "displayName": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_2",
                            "description": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "displayName": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}