{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('bd4e24e3-5041-40cb-aa2d-01396822c41e')/settings(settingDefinitions())",
    "@odata.count": 33,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Accounts Block Microsoft Accounts",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#accounts_blockmicrosoftaccounts"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Accounts_BlockMicrosoftAccounts",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts",
                    "description": "This policy setting prevents users from adding new Microsoft accounts on this computer.  If you select the \"Users can’t add Microsoft accounts\" option, users will not be able to create new Microsoft accounts on this computer, switch a local account to a Microsoft account, or connect a domain account to a Microsoft account. This is the preferred option if you need to limit the use of Microsoft accounts in your enterprise.  If you select the \"Users can’t add or log on with Microsoft accounts\" option, existing Microsoft account users will not be able to log on to Windows. Selecting this option might make it impossible for an existing administrator on this computer to log on and manage the system.  If you disable or do not configure this policy (recommended), users will be able to use Microsoft accounts with Windows.",
                    "helpText": "",
                    "name": "Accounts_BlockMicrosoftAccounts",
                    "displayName": "Accounts Block Microsoft Accounts",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts_0",
                            "description": "Disabled (users will be able to use Microsoft accounts with Windows).",
                            "helpText": null,
                            "name": "Disabled (users will be able to use Microsoft accounts with Windows).",
                            "displayName": "Disabled (users will be able to use Microsoft accounts with Windows).",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts_1",
                            "description": "Enabled (users can't add Microsoft accounts).",
                            "helpText": null,
                            "name": "Enabled (users can't add Microsoft accounts).",
                            "displayName": "Enabled (users can't add Microsoft accounts).",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_blockmicrosoftaccounts_3",
                            "description": "Users can't add or log on with Microsoft accounts",
                            "helpText": null,
                            "name": "Users can't add or log on with Microsoft accounts",
                            "displayName": "Users can't add or log on with Microsoft accounts",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Accounts Enable Guest Account Status",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#accounts_enableguestaccountstatus"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Accounts_EnableGuestAccountStatus",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus",
                    "description": "This security setting determines if the Guest account is enabled or disabled.  Default: Disabled.  Note: If the Guest account is disabled and the security option Network Access: Sharing and Security Model for local accounts is set to Guest Only, network logons, such as those performed by the Microsoft Network Server (SMB Service), will fail.",
                    "helpText": "",
                    "name": "Accounts_EnableGuestAccountStatus",
                    "displayName": "Accounts Enable Guest Account Status",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableguestaccountstatus_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Accounts Limit Local Account Use Of Blank Passwords To Console Logon Only",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Accounts_LimitLocalAccountUseOfBlankPasswordsToConsoleLogonOnly",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly",
                    "description": "Accounts: Limit local account use of blank passwords to console logon only  This security setting determines whether local accounts that are not password protected can be used to log on from locations other than the physical computer console. If enabled, local accounts that are not password protected will only be able to log on at the computer's keyboard.  Default: Enabled.   Warning:  Computers that are not in physically secure locations should always enforce strong password policies for all local user accounts. Otherwise, anyone with physical access to the computer can log on by using a user account that does not have a password. This is especially important for portable computers. If you apply this security policy to the Everyone group, no one will be able to log on through Remote Desktop Services.  Notes  This setting does not affect logons that use domain accounts. It is possible for applications that use remote interactive logons to bypass this setting.",
                    "helpText": "",
                    "name": "Accounts_LimitLocalAccountUseOfBlankPasswordsToConsoleLogonOnly",
                    "displayName": "Accounts Limit Local Account Use Of Blank Passwords To Console Logon Only",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_limitlocalaccountuseofblankpasswordstoconsolelogononly_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameadministratoraccount",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "Admin"
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Accounts Rename Administrator Account",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#accounts_renameadministratoraccount"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Accounts_RenameAdministratorAccount",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameadministratoraccount",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameadministratoraccount",
                    "description": "Accounts: Rename administrator account  This security setting determines whether a different account name is associated with the security identifier (SID) for the account Administrator. Renaming the well-known Administrator account makes it slightly more difficult for unauthorized persons to guess this privileged user name and password combination.  Default: Administrator.",
                    "helpText": "",
                    "name": "Accounts_RenameAdministratorAccount",
                    "displayName": "Accounts Rename Administrator Account",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 87516,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": "Administrator"
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameguestaccount",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "Gtest"
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Accounts Rename Guest Account",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#accounts_renameguestaccount"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/Accounts_RenameGuestAccount",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameguestaccount",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameguestaccount",
                    "description": "Accounts: Rename guest account  This security setting determines whether a different account name is associated with the security identifier (SID) for the account \"Guest.\" Renaming the well-known Guest account makes it slightly more difficult for unauthorized persons to guess this user name and password combination.  Default: Guest.",
                    "helpText": "",
                    "name": "Accounts_RenameGuestAccount",
                    "displayName": "Accounts Rename Guest Account",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 87516,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": "Guest"
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Do Not Display Last Signed In",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_donotdisplaylastsignedin"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_DoNotDisplayLastSignedIn",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin",
                    "description": "Interactive logon: Don't display last signed-in This security setting determines whether the Windows sign-in screen will show the username of the last person who signed in on this PC. If this policy is enabled, the username will not be shown.  If this policy is disabled, the username will be shown.  Default: Disabled.",
                    "helpText": "",
                    "name": "InteractiveLogon_DoNotDisplayLastSignedIn",
                    "displayName": "Interactive Logon Do Not Display Last Signed In",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin_0",
                            "description": "Disabled (username will be shown)",
                            "helpText": null,
                            "name": "Disabled (username will be shown)",
                            "displayName": "Disabled (username will be shown)",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotdisplaylastsignedin_1",
                            "description": "Enabled (username will not be shown)",
                            "helpText": null,
                            "name": "Enabled (username will not be shown)",
                            "displayName": "Enabled (username will not be shown)",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Do Not Require CTRLALTDEL",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_donotrequirectrlaltdel"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_DoNotRequireCTRLALTDEL",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel",
                    "description": "Interactive logon: Do not require CTRL+ALT+DEL  This security setting determines whether pressing CTRL+ALT+DEL is required before a user can log on.  If this policy is enabled on a computer, a user is not required to press CTRL+ALT+DEL to log on. Not having to press CTRL+ALT+DEL leaves users susceptible to attacks that attempt to intercept the users' passwords. Requiring CTRL+ALT+DEL before users log on ensures that users are communicating by means of a trusted path when entering their passwords.  If this policy is disabled, any user is required to press CTRL+ALT+DEL before logging on to Windows.  Default on domain-computers: Enabled: At least Windows  8/Disabled: Windows 7 or earlier. Default on stand-alone computers: Enabled.",
                    "helpText": "",
                    "name": "InteractiveLogon_DoNotRequireCTRLALTDEL",
                    "displayName": "Interactive Logon Do Not Require CTRLALTDEL",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_donotrequirectrlaltdel_1",
                            "description": "Enabled (a user is not required to press CTRL+ALT+DEL to log on)",
                            "helpText": null,
                            "name": "Enabled (a user is not required to press CTRL+ALT+DEL to log on)",
                            "displayName": "Enabled (a user is not required to press CTRL+ALT+DEL to log on)",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_machineinactivitylimit_v2",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                    "settingValueTemplateReference": null,
                    "value": 900
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Machine Inactivity Limit",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_machineinactivitylimit"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_MachineInactivityLimit",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_machineinactivitylimit_v2",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_machineinactivitylimit_v2",
                    "description": "Interactive logon: Machine inactivity limit.  Windows notices inactivity of a logon session, and if the amount of inactive time exceeds the inactivity limit, then the screen saver will run, locking the session.  Default: not enforced.",
                    "helpText": "",
                    "name": "InteractiveLogon_MachineInactivityLimit",
                    "displayName": "Interactive Logon Machine Inactivity Limit",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 599940,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Interactive Logon Smart Card Removal Behavior",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#interactivelogon_smartcardremovalbehavior"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/InteractiveLogon_SmartCardRemovalBehavior",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior",
                    "description": "Interactive logon: Smart card removal behavior  This security setting determines what happens when the smart card for a logged-on user is removed from the smart card reader.  The options are:   No Action  Lock Workstation  Force Logoff  Disconnect if a Remote Desktop Services session   If you click Lock Workstation in the Properties dialog box for this policy, the workstation is locked when the smart card is removed, allowing users to leave the area, take their smart card with them, and still maintain a protected session.  If you click Force Logoff in the Properties dialog box for this policy, the user is automatically logged off when the smart card is removed.  If you click Disconnect if a Remote Desktop Services session, removal of the smart card disconnects the session without logging the user off. This allows the user to insert the smart card and resume the session later, or at another smart card reader-equipped computer, without having to log on again. If the session is local, this policy functions identically to Lock Workstation.  Note: Remote Desktop Services was called Terminal Services in previous versions of Windows Server.  Default: This policy is not defined, which means that the system treats it as No action.  On Windows Vista and above: For this setting to work, the Smart Card Removal Policy service must be started.",
                    "helpText": "",
                    "name": "InteractiveLogon_SmartCardRemovalBehavior",
                    "displayName": "Interactive Logon Smart Card Removal Behavior",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_0",
                            "description": "No Action",
                            "helpText": null,
                            "name": "No Action",
                            "displayName": "No Action",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "0"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_1",
                            "description": "Lock Workstation",
                            "helpText": null,
                            "name": "Lock Workstation",
                            "displayName": "Lock Workstation",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "1"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_2",
                            "description": "Force Logoff",
                            "helpText": null,
                            "name": "Force Logoff",
                            "displayName": "Force Logoff",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "2"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_smartcardremovalbehavior_3",
                            "description": "Disconnect Remote Desktop Session",
                            "helpText": null,
                            "name": "Disconnect if a Remote Desktop Services session",
                            "displayName": "Disconnect Remote Desktop Session",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "3"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Microsoft Network Client Digitally Sign Communications Always",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#microsoftnetworkclient_digitallysigncommunicationsalways"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/MicrosoftNetworkClient_DigitallySignCommunicationsAlways",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways",
                    "description": "Microsoft network client: Digitally sign communications (always)  This security setting determines whether packet signing is required by the SMB client component.  The server message block (SMB) protocol provides the basis for Microsoft file and print sharing and many other networking operations, such as remote Windows administration. To prevent man-in-the-middle attacks that modify SMB packets in transit, the SMB protocol supports the digital signing of SMB packets. This policy setting determines whether SMB packet signing must be negotiated before further communication with an SMB server is permitted.  If this setting is enabled, the Microsoft network client will not communicate with a Microsoft network server unless that server agrees to perform SMB packet signing. If this policy is disabled, SMB packet signing is negotiated between the client and server.  Default: Disabled.  Important  For this policy to take effect on computers running Windows 2000, client-side packet signing must also be enabled. To enable client-side SMB packet signing, set Microsoft network client: Digitally sign communications (if server agrees).  Notes  All Windows operating systems support both a client-side SMB component and a server-side SMB component. On Windows 2000 and later operating systems, enabling or requiring packet signing for client and server-side SMB components is controlled by the following four policy settings: Microsoft network client: Digitally sign communications (always) - Controls whether or not the client-side SMB component requires packet signing. Microsoft network client: Digitally sign communications (if server agrees) - Controls whether or not the client-side SMB component has packet signing enabled. Microsoft network server: Digitally sign communications (always) - Controls whether or not the server-side SMB component requires packet signing. Microsoft network server: Digitally sign communications (if client agrees) - Controls whether or not the server-side SMB component has packet signing enabled. SMB packet signing can significantly degrade SMB performance, depending on dialect version, OS version, file sizes, processor offloading capabilities, and application IO behaviors. For more information, reference: https://go.microsoft.com/fwlink/?LinkID=787136.",
                    "helpText": "",
                    "name": "MicrosoftNetworkClient_DigitallySignCommunicationsAlways",
                    "displayName": "Microsoft Network Client Digitally Sign Communications Always",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "8.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17763",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsalways_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Microsoft Network Client Digitally Sign Communications If Server Agrees",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#microsoftnetworkclient_digitallysigncommunicationsifserveragrees"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/MicrosoftNetworkClient_DigitallySignCommunicationsIfServerAgrees",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees",
                    "description": "Microsoft network client: Digitally sign communications (if server agrees)  This security setting determines whether the SMB client attempts to negotiate SMB packet signing.  The server message block (SMB) protocol provides the basis for Microsoft file and print sharing and many other networking operations, such as remote Windows administration. To prevent man-in-the-middle attacks that modify SMB packets in transit, the SMB protocol supports the digital signing of SMB packets. This policy setting determines whether the SMB client component attempts to negotiate SMB packet signing when it connects to an SMB server.  If this setting is enabled, the Microsoft network client will ask the server to perform SMB packet signing upon session setup. If packet signing has been enabled on the server, packet signing will be negotiated. If this policy is disabled, the SMB client will never negotiate SMB packet signing.  Default: Enabled.  Notes  All Windows operating systems support both a client-side SMB component and a server-side SMB component. On Windows 2000 and later, enabling or requiring packet signing for client and server-side SMB components is controlled by the following four policy settings: Microsoft network client: Digitally sign communications (always) - Controls whether or not the client-side SMB component requires packet signing. Microsoft network client: Digitally sign communications (if server agrees) - Controls whether or not the client-side SMB component has packet signing enabled. Microsoft network server: Digitally sign communications (always) - Controls whether or not the server-side SMB component requires packet signing. Microsoft network server: Digitally sign communications (if client agrees) - Controls whether or not the server-side SMB component has packet signing enabled. If both client-side and server-side SMB signing is enabled and the client establishes an SMB 1.0 connection to the server, SMB signing will be attempted. SMB packet signing can significantly degrade SMB performance, depending on dialect version, OS version, file sizes, processor offloading capabilities, and application IO behaviors. This setting only applies to SMB 1.0 connections. For more information, reference: https://go.microsoft.com/fwlink/?LinkID=787136.",
                    "helpText": "",
                    "name": "MicrosoftNetworkClient_DigitallySignCommunicationsIfServerAgrees",
                    "displayName": "Microsoft Network Client Digitally Sign Communications If Server Agrees",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_digitallysigncommunicationsifserveragrees_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Microsoft Network Client Send Unencrypted Password To Third Party SMB Servers",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/MicrosoftNetworkClient_SendUnencryptedPasswordToThirdPartySMBServers",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers",
                    "description": "Microsoft network client: Send unencrypted password to connect to third-party SMB servers  If this security setting is enabled, the Server Message Block (SMB) redirector is allowed to send plaintext passwords to non-Microsoft SMB servers that do not support password encryption during authentication.  Sending unencrypted passwords is a security risk.  Default: Disabled.",
                    "helpText": "",
                    "name": "MicrosoftNetworkClient_SendUnencryptedPasswordToThirdPartySMBServers",
                    "displayName": "Microsoft Network Client Send Unencrypted Password To Third Party SMB Servers",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkclient_sendunencryptedpasswordtothirdpartysmbservers_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "12",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Microsoft Network Server Digitally Sign Communications Always",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#microsoftnetworkserver_digitallysigncommunicationsalways"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/MicrosoftNetworkServer_DigitallySignCommunicationsAlways",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways",
                    "description": "Microsoft network server: Digitally sign communications (always)  This security setting determines whether packet signing is required by the SMB server component.  The server message block (SMB) protocol provides the basis for Microsoft file and print sharing and many other networking operations, such as remote Windows administration. To prevent man-in-the-middle attacks that modify SMB packets in transit, the SMB protocol supports the digital signing of SMB packets. This policy setting determines whether SMB packet signing must be negotiated before further communication with an SMB client is permitted.  If this setting is enabled, the Microsoft network server will not communicate with a Microsoft network client unless that client agrees to perform SMB packet signing. If this setting is disabled, SMB packet signing is negotiated between the client and server.  Default:  Disabled for member servers. Enabled for domain controllers.  Notes  All Windows operating systems support both a client-side SMB component and a server-side SMB component. On Windows 2000 and later, enabling or requiring packet signing for client and server-side SMB components is controlled by the following four policy settings: Microsoft network client: Digitally sign communications (always) - Controls whether or not the client-side SMB component requires packet signing. Microsoft network client: Digitally sign communications (if server agrees) - Controls whether or not the client-side SMB component has packet signing enabled. Microsoft network server: Digitally sign communications (always) - Controls whether or not the server-side SMB component requires packet signing. Microsoft network server: Digitally sign communications (if client agrees) - Controls whether or not the server-side SMB component has packet signing enabled. Similarly, if client-side SMB signing is required, that client will not be able to establish a session with servers that do not have packet signing enabled. By default, server-side SMB signing is enabled only on domain controllers. If server-side SMB signing is enabled, SMB packet signing will be negotiated with clients that have client-side SMB signing enabled. SMB packet signing can significantly degrade SMB performance, depending on dialect version, OS version, file sizes, processor offloading capabilities, and application IO behaviors.  Important  For this policy to take effect on computers running Windows 2000, server-side packet signing must also be enabled. To enable server-side SMB packet signing, set the following policy: Microsoft network server: Digitally sign communications (if server agrees)  For Windows 2000 servers to negotiate signing with Windows NT 4.0 clients, the following registry value must be set to 1 on the Windows 2000 server: HKLM\\System\\CurrentControlSet\\Services\\lanmanserver\\parameters\\enableW9xsecuritysignature For more information, reference: https://go.microsoft.com/fwlink/?LinkID=787136.",
                    "helpText": "",
                    "name": "MicrosoftNetworkServer_DigitallySignCommunicationsAlways",
                    "displayName": "Microsoft Network Server Digitally Sign Communications Always",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsalways_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "13",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Microsoft Network Server Digitally Sign Communications If Client Agrees",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#microsoftnetworkserver_digitallysigncommunicationsifclientagrees"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/MicrosoftNetworkServer_DigitallySignCommunicationsIfClientAgrees",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees",
                    "description": "Microsoft network server: Digitally sign communications (if client agrees)  This security setting determines whether the SMB server will negotiate SMB packet signing with clients that request it.  The server message block (SMB) protocol provides the basis for Microsoft file and print sharing and many other networking operations, such as remote Windows administration. To prevent man-in-the-middle attacks that modify SMB packets in transit, the SMB protocol supports the digital signing of SMB packets. This policy setting determines whether the SMB server will negotiate SMB packet signing when an SMB client requests it.  If this setting is enabled, the Microsoft network server will negotiate SMB packet signing as requested by the client. That is, if packet signing has been enabled on the client, packet signing will be negotiated. If this policy is disabled, the SMB client will never negotiate SMB packet signing.  Default: Enabled on domain controllers only.  Important  For Windows 2000 servers to negotiate signing with Windows NT 4.0 clients, the following registry value must be set to 1 on the server running Windows 2000: HKLM\\System\\CurrentControlSet\\Services\\lanmanserver\\parameters\\enableW9xsecuritysignature  Notes  All Windows operating systems support both a client-side SMB component and a server-side SMB component. For Windows 2000 and above, enabling or requiring packet signing for client and server-side SMB components is controlled by the following four policy settings: Microsoft network client: Digitally sign communications (always) - Controls whether or not the client-side SMB component requires packet signing. Microsoft network client: Digitally sign communications (if server agrees) - Controls whether or not the client-side SMB component has packet signing enabled. Microsoft network server: Digitally sign communications (always) - Controls whether or not the server-side SMB component requires packet signing. Microsoft network server: Digitally sign communications (if client agrees) - Controls whether or not the server-side SMB component has packet signing enabled. If both client-side and server-side SMB signing is enabled and the client establishes an SMB 1.0 connection to the server, SMB signing will be attempted. SMB packet signing can significantly degrade SMB performance, depending on dialect version, OS version, file sizes, processor offloading capabilities, and application IO behaviors. This setting only applies to SMB 1.0 connections. For more information, reference: https://go.microsoft.com/fwlink/?LinkID=787136.",
                    "helpText": "",
                    "name": "MicrosoftNetworkServer_DigitallySignCommunicationsIfClientAgrees",
                    "displayName": "Microsoft Network Server Digitally Sign Communications If Client Agrees",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_microsoftnetworkserver_digitallysigncommunicationsifclientagrees_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "14",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Access Do Not Allow Anonymous Enumeration Of SAM Accounts",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networkaccess_donotallowanonymousenumerationofsamaccounts"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkAccess_DoNotAllowAnonymousEnumerationOfSAMAccounts",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts",
                    "description": "Network access: Do not allow anonymous enumeration of SAM accounts  This security setting determines what additional permissions will be granted for anonymous connections to the computer.  Windows allows anonymous users to perform certain activities, such as enumerating the names of domain accounts and network shares. This is convenient, for example, when an administrator wants to grant access to users in a trusted domain that does not maintain a reciprocal trust.  This security option allows additional restrictions to be placed on anonymous connections as follows:  Enabled: Do not allow enumeration of SAM accounts. This option replaces Everyone with Authenticated Users in the security permissions for resources. Disabled: No additional restrictions. Rely on default permissions.  Default on workstations: Enabled. Default on server:Enabled.  Important  This policy has no impact on domain controllers.",
                    "helpText": "",
                    "name": "NetworkAccess_DoNotAllowAnonymousEnumerationOfSAMAccounts",
                    "displayName": "Network Access Do Not Allow Anonymous Enumeration Of SAM Accounts",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccounts_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "15",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Access Do Not Allow Anonymous Enumeration Of Sam Accounts And Shares",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networkaccess_donotallowanonymousenumerationofsamaccountsandshares"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkAccess_DoNotAllowAnonymousEnumerationOfSamAccountsAndShares",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares",
                    "description": "Network access: Do not allow anonymous enumeration of SAM accounts and shares  This security setting determines whether anonymous enumeration of SAM accounts and shares is allowed.  Windows allows anonymous users to perform certain activities, such as enumerating the names of domain accounts and network shares. This is convenient, for example, when an administrator wants to grant access to users in a trusted domain that does not maintain a reciprocal trust. If you do not want to allow anonymous enumeration of SAM accounts and shares, then enable this policy.  Default: Disabled.",
                    "helpText": "",
                    "name": "NetworkAccess_DoNotAllowAnonymousEnumerationOfSamAccountsAndShares",
                    "displayName": "Network Access Do Not Allow Anonymous Enumeration Of Sam Accounts And Shares",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_donotallowanonymousenumerationofsamaccountsandshares_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "16",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Access Restrict Anonymous Access To Named Pipes And Shares",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networkaccess_restrictanonymousaccesstonamedpipesandshares"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkAccess_RestrictAnonymousAccessToNamedPipesAndShares",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares",
                    "description": "Network access: Restrict anonymous access to Named Pipes and Shares  When enabled, this security setting restricts anonymous access to shares and pipes to the settings for:  Network access: Named pipes that can be accessed anonymously Network access: Shares that can be accessed anonymously Default: Enabled.",
                    "helpText": "",
                    "name": "NetworkAccess_RestrictAnonymousAccessToNamedPipesAndShares",
                    "displayName": "Network Access Restrict Anonymous Access To Named Pipes And Shares",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictanonymousaccesstonamedpipesandshares_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "17",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictclientsallowedtomakeremotecallstosam",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "O:BAG:BAD:(A;;RC;;;BA)"
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Access Restrict Clients Allowed To Make Remote Calls To SAM",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networkaccess_restrictclientsallowedtomakeremotecallstosam"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkAccess_RestrictClientsAllowedToMakeRemoteCallsToSAM",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictclientsallowedtomakeremotecallstosam",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networkaccess_restrictclientsallowedtomakeremotecallstosam",
                    "description": "Network access: Restrict clients allowed to make remote calls to SAM  This policy setting allows you to restrict remote rpc connections to SAM.  If not selected, the default security descriptor will be used.  This policy is supported on at least Windows Server 2016.",
                    "helpText": "",
                    "name": "NetworkAccess_RestrictClientsAllowedToMakeRemoteCallsToSAM",
                    "displayName": "Network Access Restrict Clients Allowed To Make Remote Calls To SAM",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 87516,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": null
                    },
                    "dependentOn": [],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "18",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Allow Local System To Use Computer Identity For NTLM",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_allowlocalsystemtousecomputeridentityforntlm"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_AllowLocalSystemToUseComputerIdentityForNTLM",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm",
                    "description": "Network security: Allow Local System to use computer identity for NTLM  This policy setting allows Local System services that use Negotiate to use the computer identity when reverting to NTLM authentication.  If you enable this policy setting, services running as Local System that use Negotiate will use the computer identity. This might cause some authentication requests between Windows operating systems to fail and log an error.  If you disable this policy setting, services running as Local System that use Negotiate when reverting to NTLM authentication will authenticate anonymously.  By default, this policy is enabled on Windows 7 and above.  By default, this policy is disabled on Windows Vista.  This policy is supported on at least Windows Vista or Windows Server 2008.  Note: Windows Vista or Windows Server 2008 do not expose this setting in Group Policy.",
                    "helpText": "",
                    "name": "NetworkSecurity_AllowLocalSystemToUseComputerIdentityForNTLM",
                    "displayName": "Network Security Allow Local System To Use Computer Identity For NTLM",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "8.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17763",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm_1",
                            "description": "Allow",
                            "helpText": null,
                            "name": "Allow",
                            "displayName": "Allow",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowlocalsystemtousecomputeridentityforntlm_0",
                            "description": "Block",
                            "helpText": null,
                            "name": "Block",
                            "displayName": "Block",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "19",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Allow PKU2U Authentication Requests",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_allowpku2uauthenticationrequests"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_AllowPKU2UAuthenticationRequests",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests",
                    "description": "Network security: Allow PKU2U authentication requests to this computer to use online identities.  This policy will be turned off by default on domain joined machines. This would prevent online identities from authenticating to the domain joined machine.",
                    "helpText": "",
                    "name": "NetworkSecurity_AllowPKU2UAuthenticationRequests",
                    "displayName": "Network Security Allow PKU2U Authentication Requests",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests_0",
                            "description": "Block",
                            "helpText": null,
                            "name": "Block",
                            "displayName": "Block",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_allowpku2uauthenticationrequests_1",
                            "description": "Allow",
                            "helpText": null,
                            "name": "Allow",
                            "displayName": "Allow",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "20",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Do Not Store LAN Manager Hash Value On Next Password Change",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_DoNotStoreLANManagerHashValueOnNextPasswordChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange",
                    "description": "Network security: Do not store LAN Manager hash value on next password change  This security setting determines if, at the next password change, the LAN Manager (LM) hash value for the new password is stored. The LM hash is relatively weak and prone to attack, as compared with the cryptographically stronger Windows NT hash. Since the LM hash is stored on the local computer in the security database the passwords can be compromised if the security database is attacked.   Default on Windows Vista and above: Enabled Default on Windows XP: Disabled.  Important  Windows 2000 Service Pack 2 (SP2) and above offer compatibility with authentication to previous versions of Windows, such as Microsoft Windows NT 4.0. This setting can affect the ability of computers running Windows 2000 Server, Windows 2000 Professional, Windows XP, and the Windows Server 2003 family to communicate with computers running Windows 95 and Windows 98.",
                    "helpText": "",
                    "name": "NetworkSecurity_DoNotStoreLANManagerHashValueOnNextPasswordChange",
                    "displayName": "Network Security Do Not Store LAN Manager Hash Value On Next Password Change",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_donotstorelanmanagerhashvalueonnextpasswordchange_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "21",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_5",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security LAN Manager Authentication Level",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_lanmanagerauthenticationlevel"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_LANManagerAuthenticationLevel",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel",
                    "description": "Network security LAN Manager authentication level  This security setting determines which challenge/response authentication protocol is used for network logons. This choice affects the level of authentication protocol used by clients, the level of session security negotiated, and the level of authentication accepted by servers as follows:  Send LM and NTLM responses: Clients use LM and NTLM authentication and never use NTLMv2 session security; domain controllers accept LM, NTLM, and NTLMv2 authentication.  Send LM and NTLM - use NTLMv2 session security if negotiated: Clients use LM and NTLM authentication and use NTLMv2 session security if the server supports it; domain controllers accept LM, NTLM, and NTLMv2 authentication.  Send NTLM response only: Clients use NTLM authentication only and use NTLMv2 session security if the server supports it; domain controllers accept LM, NTLM, and NTLMv2 authentication.  Send NTLMv2 response only: Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it; domain controllers accept LM, NTLM, and NTLMv2 authentication.  Send NTLMv2 response only\\refuse LM: Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it; domain controllers refuse LM (accept only NTLM and NTLMv2 authentication).  Send NTLMv2 response only\\refuse LM and NTLM: Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it; domain controllers refuse LM and NTLM (accept only NTLMv2 authentication).  Important  This setting can affect the ability of computers running Windows 2000 Server, Windows 2000 Professional, Windows XP Professional, and the Windows Server 2003 family to communicate with computers running Windows NT 4.0 and earlier over the network. For example, at the time of this writing, computers running Windows NT 4.0 SP4 and earlier did not support NTLMv2. Computers running Windows 95 and Windows 98 did not support NTLM.  Default:  Windows 2000 and windows XP: send LM and NTLM responses  Windows Server 2003: Send NTLM response only  Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2: Send NTLMv2 response only",
                    "helpText": "",
                    "name": "NetworkSecurity_LANManagerAuthenticationLevel",
                    "displayName": "Network Security LAN Manager Authentication Level",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_3",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_0",
                            "description": "Send LM and NTLM responses",
                            "helpText": null,
                            "name": "Send LM and NTLM responses",
                            "displayName": "Send LM and NTLM responses",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_1",
                            "description": "Send LM and NTLM-use NTLMv2 session security if negotiated",
                            "helpText": null,
                            "name": "Send LM and NTLM-use NTLMv2 session security if negotiated",
                            "displayName": "Send LM and NTLM-use NTLMv2 session security if negotiated",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_2",
                            "description": "Send LM and NTLM responses only",
                            "helpText": null,
                            "name": "Send LM and NTLM responses only",
                            "displayName": "Send LM and NTLM responses only",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_3",
                            "description": "Send NTLMv2 responses only",
                            "helpText": null,
                            "name": "Send NTLMv2 responses only",
                            "displayName": "Send NTLMv2 responses only",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_4",
                            "description": "Send NTLMv2 responses only. Refuse LM",
                            "helpText": null,
                            "name": "Send NTLMv2 responses only. Refuse LM",
                            "displayName": "Send NTLMv2 responses only. Refuse LM",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 4
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_lanmanagerauthenticationlevel_5",
                            "description": "Send NTLMv2 responses only. Refuse LM and NTLM",
                            "helpText": null,
                            "name": "Send NTLMv2 responses only. Refuse LM and NTLM",
                            "displayName": "Send NTLMv2 responses only. Refuse LM and NTLM",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 5
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "22",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_537395200",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Minimum Session Security For NTLMSSP Based Clients",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_minimumsessionsecurityforntlmsspbasedclients"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_MinimumSessionSecurityForNTLMSSPBasedClients",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients",
                    "description": "Network security: Minimum session security for NTLM SSP based (including secure RPC) clients  This security setting allows a client to require the negotiation of 128-bit encryption and/or NTLMv2 session security. These values are dependent on the LAN Manager Authentication Level security setting value. The options are:  Require NTLMv2 session security: The connection will fail if NTLMv2 protocol is not negotiated. Require 128-bit encryption: The connection will fail if strong encryption (128-bit) is not negotiated.  Default:  Windows XP, Windows Vista, Windows 2000 Server, Windows Server 2003, and Windows Server 2008: No requirements.  Windows 7 and Windows Server 2008 R2: Require 128-bit encryption",
                    "helpText": "",
                    "name": "NetworkSecurity_MinimumSessionSecurityForNTLMSSPBasedClients",
                    "displayName": "Network Security Minimum Session Security For NTLMSSP Based Clients",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_536870912",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "8.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17763",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_0",
                            "description": "None",
                            "helpText": null,
                            "name": "None",
                            "displayName": "None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_524288",
                            "description": "Require NTLMv2 session security",
                            "helpText": null,
                            "name": "Require NTLMv2 session security",
                            "displayName": "Require NTLMv2 session security",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 524288
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_536870912",
                            "description": "Require 128-bit encryption",
                            "helpText": null,
                            "name": "Require 128-bit encryption",
                            "displayName": "Require 128-bit encryption",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 536870912
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedclients_537395200",
                            "description": "Require NTLM and 128-bit encryption",
                            "helpText": null,
                            "name": "Require NTLM and 128-bit encryption",
                            "displayName": "Require NTLM and 128-bit encryption",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 537395200
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "23",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_537395200",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Minimum Session Security For NTLMSSP Based Servers",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_minimumsessionsecurityforntlmsspbasedservers"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_MinimumSessionSecurityForNTLMSSPBasedServers",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers",
                    "description": "Network security: Minimum session security for NTLM SSP based (including secure RPC) servers  This security setting allows a server to require the negotiation of 128-bit encryption and/or NTLMv2 session security. These values are dependent on the LAN Manager Authentication Level security setting value. The options are:  Require NTLMv2 session security: The connection will fail if message integrity is not negotiated. Require 128-bit encryption. The connection will fail if strong encryption (128-bit) is not negotiated.  Default:  Windows XP, Windows Vista, Windows 2000 Server, Windows Server 2003, and Windows Server 2008: No requirements.  Windows 7 and Windows Server 2008 R2: Require 128-bit encryption",
                    "helpText": "",
                    "name": "NetworkSecurity_MinimumSessionSecurityForNTLMSSPBasedServers",
                    "displayName": "Network Security Minimum Session Security For NTLMSSP Based Servers",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_536870912",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_0",
                            "description": "None",
                            "helpText": null,
                            "name": "None",
                            "displayName": "None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_524288",
                            "description": "Require NTLMv2 session security",
                            "helpText": null,
                            "name": "Require NTLMv2 session security",
                            "displayName": "Require NTLMv2 session security",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 524288
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_536870912",
                            "description": "Require 128-bit encryption",
                            "helpText": null,
                            "name": "Require 128-bit encryption",
                            "displayName": "Require 128-bit encryption",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 536870912
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_minimumsessionsecurityforntlmsspbasedservers_537395200",
                            "description": "Require NTLM and 128-bit encryption",
                            "helpText": null,
                            "name": "Require NTLM and 128-bit encryption",
                            "displayName": "Require NTLM and 128-bit encryption",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 537395200
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "24",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Network Security Restrict NTLM Audit Incoming NTLM Traffic",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#networksecurity_restrictntlm_auditincomingntlmtraffic"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/NetworkSecurity_RestrictNTLM_AuditIncomingNTLMTraffic",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic",
                    "description": "Network security: Restrict NTLM: Audit Incoming NTLM Traffic  This policy setting allows you to audit incoming NTLM traffic.  If you select \"Disable\", or do not configure this policy setting, the server will not log events for incoming NTLM traffic.  If you select \"Enable auditing for domain accounts\", the server will log events for NTLM pass-through authentication requests that would be blocked when the \"Network Security: Restrict NTLM: Incoming NTLM traffic\" policy setting is set to the \"Deny all domain accounts\" option.  If you select \"Enable auditing for all accounts\", the server will log events for all NTLM authentication requests that would be blocked when the \"Network Security: Restrict NTLM: Incoming NTLM traffic\" policy setting is set to the \"Deny all accounts\" option.  This policy is supported on at least Windows 7 or Windows Server 2008 R2.  Note: Audit events are recorded on this computer in the \"Operational\" Log located under the Applications and Services Log/Microsoft/Windows/NTLM.",
                    "helpText": "",
                    "name": "NetworkSecurity_RestrictNTLM_AuditIncomingNTLMTraffic",
                    "displayName": "Network Security Restrict NTLM Audit Incoming NTLM Traffic",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic_1",
                            "description": "Enable auditing for domain accounts",
                            "helpText": null,
                            "name": "Enable auditing for domain accounts",
                            "displayName": "Enable auditing for domain accounts",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_networksecurity_restrictntlm_auditincomingntlmtraffic_2",
                            "description": "Enable auditing for all accounts",
                            "helpText": null,
                            "name": "Enable auditing for all accounts",
                            "displayName": "Enable auditing for all accounts",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "25",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Behavior Of The Elevation Prompt For Administrators",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_behavioroftheelevationpromptforadministrators"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_BehaviorOfTheElevationPromptForAdministrators",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators",
                    "description": "User Account Control: Behavior of the elevation prompt for administrators in Admin Approval Mode  This policy setting controls the behavior of the elevation prompt for administrators.  The options are:  • Elevate without prompting: Allows privileged accounts to perform an operation that requires elevation without requiring consent or credentials. Note: Use this option only in the most constrained environments.  • Prompt for credentials on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to enter a privileged user name and password. If the user enters valid credentials, the operation continues with the user's highest available privilege.  • Prompt for consent on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.  • Prompt for credentials: When an operation requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.  • Prompt for consent: When an operation requires elevation of privilege, the user is prompted to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.  • Prompt for consent for non-Windows binaries: (Default) When an operation for a non-Microsoft application requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.",
                    "helpText": "",
                    "name": "UserAccountControl_BehaviorOfTheElevationPromptForAdministrators",
                    "displayName": "User Account Control Behavior Of The Elevation Prompt For Administrators",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_5",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_0",
                            "description": "Elevate without prompting",
                            "helpText": null,
                            "name": "Elevate without prompting",
                            "displayName": "Elevate without prompting",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_1",
                            "description": "Prompt for credentials on the secure desktop",
                            "helpText": null,
                            "name": "Prompt for credentials on the secure desktop",
                            "displayName": "Prompt for credentials on the secure desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_2",
                            "description": "Prompt for consent on the secure desktop",
                            "helpText": null,
                            "name": "Prompt for consent on the secure desktop",
                            "displayName": "Prompt for consent on the secure desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_3",
                            "description": "Prompt for credentials",
                            "helpText": null,
                            "name": "Prompt for credentials",
                            "displayName": "Prompt for credentials",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_4",
                            "description": "Prompt for consent",
                            "helpText": null,
                            "name": "Prompt for consent",
                            "displayName": "Prompt for consent",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 4
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforadministrators_5",
                            "description": "Prompt for consent for non-Windows binaries",
                            "helpText": null,
                            "name": "Prompt for consent for non-Windows binaries",
                            "displayName": "Prompt for consent for non-Windows binaries",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 5
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "26",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_0",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Behavior Of The Elevation Prompt For Standard Users",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_behavioroftheelevationpromptforstandardusers"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_BehaviorOfTheElevationPromptForStandardUsers",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers",
                    "description": "User Account Control: Behavior of the elevation prompt for standard users This policy setting controls the behavior of the elevation prompt for standard users.  The options are:  • Prompt for credentials: (Default) When an operation requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.  • Automatically deny elevation requests: When an operation requires elevation of privilege, a configurable access denied error message is displayed. An enterprise that is running desktops as standard user may choose this setting to reduce help desk calls.  • Prompt for credentials on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to enter a different user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.",
                    "helpText": "",
                    "name": "UserAccountControl_BehaviorOfTheElevationPromptForStandardUsers",
                    "displayName": "User Account Control Behavior Of The Elevation Prompt For Standard Users",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_3",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_0",
                            "description": "Automatically deny elevation requests",
                            "helpText": null,
                            "name": "Automatically deny elevation requests",
                            "displayName": "Automatically deny elevation requests",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_1",
                            "description": "Prompt for credentials on the secure desktop",
                            "helpText": null,
                            "name": "Prompt for credentials on the secure desktop",
                            "displayName": "Prompt for credentials on the secure desktop",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_behavioroftheelevationpromptforstandardusers_3",
                            "description": "Prompt for credentials",
                            "helpText": null,
                            "name": "Prompt for credentials",
                            "displayName": "Prompt for credentials",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "27",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Detect Application Installations And Prompt For Elevation",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_detectapplicationinstallationsandpromptforelevation"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_DetectApplicationInstallationsAndPromptForElevation",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation",
                    "description": "User Account Control: Detect application installations and prompt for elevation  This policy setting controls the behavior of application installation detection for the computer.  The options are:  Enabled: (Default) When an application installation package is detected that requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.  Disabled: Application installation packages are not detected and prompted for elevation. Enterprises that are running standard user desktops and use delegated installation technologies such as Group Policy Software Installation or Systems Management Server (SMS) should disable this policy setting. In this case, installer detection is unnecessary.",
                    "helpText": "",
                    "name": "UserAccountControl_DetectApplicationInstallationsAndPromptForElevation",
                    "displayName": "User Account Control Detect Application Installations And Prompt For Elevation",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "28",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Only Elevate UI Access Applications That Are Installed In Secure Locations",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_OnlyElevateUIAccessApplicationsThatAreInstalledInSecureLocations",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations",
                    "description": "User Account Control: Only elevate UIAccess applications that are installed in secure locations  This policy setting controls whether applications that request to run with a User Interface Accessibility (UIAccess) integrity level must reside in a secure location in the file system. Secure locations are limited to the following:  - …\\Program Files\\, including subfolders - …\\Windows\\system32\\ - …\\Program Files (x86)\\, including subfolders for 64-bit versions of Windows  Note: Windows enforces a public key infrastructure (PKI) signature check on any interactive application that requests to run with a UIAccess integrity level regardless of the state of this security setting.  The options are:  • Enabled: (Default) If an application resides in a secure location in the file system, it runs only with UIAccess integrity.  • Disabled: An application runs with UIAccess integrity even if it does not reside in a secure location in the file system.",
                    "helpText": "",
                    "name": "UserAccountControl_OnlyElevateUIAccessApplicationsThatAreInstalledInSecureLocations",
                    "displayName": "User Account Control Only Elevate UI Access Applications That Are Installed In Secure Locations",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations_0",
                            "description": "Disabled: Application runs with UIAccess integrity even if it does not reside in a secure location.",
                            "helpText": null,
                            "name": "Disabled: Application runs with UIAccess integrity even if it does not reside in a secure location.",
                            "displayName": "Disabled: Application runs with UIAccess integrity even if it does not reside in a secure location.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_onlyelevateuiaccessapplicationsthatareinstalledinsecurelocations_1",
                            "description": "Enabled: Application runs with UIAccess integrity only if it resides in secure location.",
                            "helpText": null,
                            "name": "Enabled: Application runs with UIAccess integrity only if it resides in secure location.",
                            "displayName": "Enabled: Application runs with UIAccess integrity only if it resides in secure location.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "29",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Run All Administrators In Admin Approval Mode",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_runalladministratorsinadminapprovalmode"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_RunAllAdministratorsInAdminApprovalMode",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode",
                    "description": "User Account Control: Turn on Admin Approval Mode  This policy setting controls the behavior of all User Account Control (UAC) policy settings for the computer. If you change this policy setting, you must restart your computer.  The options are:  • Enabled: (Default) Admin Approval Mode is enabled. This policy must be enabled and related UAC policy settings must also be set appropriately to allow the built-in Administrator account and all other users who are members of the Administrators group to run in Admin Approval Mode.   • Disabled: Admin Approval Mode and all related UAC policy settings are disabled. Note: If this policy setting is disabled, the Security Center notifies you that the overall security of the operating system has been reduced.",
                    "helpText": "",
                    "name": "UserAccountControl_RunAllAdministratorsInAdminApprovalMode",
                    "displayName": "User Account Control Run All Administrators In Admin Approval Mode",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_runalladministratorsinadminapprovalmode_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "30",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Switch To The Secure Desktop When Prompting For Elevation",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_SwitchToTheSecureDesktopWhenPromptingForElevation",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation",
                    "description": "User Account Control: Switch to the secure desktop when prompting for elevation  This policy setting controls whether the elevation request prompt is displayed on the interactive user's desktop or the secure desktop.  The options are:  • Enabled: (Default) All elevation requests go to the secure desktop regardless of prompt behavior policy settings for administrators and standard users.  • Disabled: All elevation requests go to the interactive user's desktop. Prompt behavior policy settings for administrators and standard users are used.",
                    "helpText": "",
                    "name": "UserAccountControl_SwitchToTheSecureDesktopWhenPromptingForElevation",
                    "displayName": "User Account Control Switch To The Secure Desktop When Prompting For Elevation",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "31",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Use Admin Approval Mode",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_useadminapprovalmode"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_UseAdminApprovalMode",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode",
                    "description": "User Account Control: Use Admin Approval Mode for the built-in Administrator account  This policy setting controls the behavior of Admin Approval Mode for the built-in Administrator account.  The options are:  • Enabled: The built-in Administrator account uses Admin Approval Mode. By default, any operation that requires elevation of privilege will prompt the user to approve the operation.  • Disabled: (Default) The built-in Administrator account runs all applications with full administrative privilege.",
                    "helpText": "",
                    "name": "UserAccountControl_UseAdminApprovalMode",
                    "displayName": "User Account Control Use Admin Approval Mode",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode_1",
                            "description": "Enable",
                            "helpText": null,
                            "name": "Enable",
                            "displayName": "Enable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_useadminapprovalmode_0",
                            "description": "Disable",
                            "helpText": null,
                            "name": "Disable",
                            "displayName": "Disable",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "32",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "User Account Control Virtualize File And Registry Write Failures To Per User Locations",
                        "Local Policies Security Options"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-LocalPoliciesSecurityOptions#useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/LocalPoliciesSecurityOptions/UserAccountControl_VirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
                    "rootDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations",
                    "categoryId": "914a31d0-ae3b-4ae5-bd31-504b9f0b91df",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations",
                    "description": "User Account Control: Virtualize file and registry write failures to per-user locations  This policy setting controls whether application write failures are redirected to defined registry and file system locations. This policy setting mitigates applications that run as administrator and write run-time application data to %ProgramFiles%, %Windir%, %Windir%\\system32, or HKLM\\Software.  The options are:  • Enabled: (Default) Application write failures are redirected at run time to defined user locations for both the file system and registry.  • Disabled: Applications that write data to protected locations fail.",
                    "helpText": "",
                    "name": "UserAccountControl_VirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
                    "displayName": "User Account Control Virtualize File And Registry Write Failures To Per User Locations",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations_0",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_virtualizefileandregistrywritefailurestoperuserlocations_1",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}