{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('6643c3b4-573c-4ee3-a17c-680d7a425e66')/settings(settingDefinitions())",
    "@odata.count": 6,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Configure System Guard Launch",
                        "Device Guard"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-deviceguard#configuresystemguardlaunch"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceGuard/ConfigureSystemGuardLaunch",
                    "rootDefinitionId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch",
                    "categoryId": "992a8a1e-428e-41cb-948e-4e5da86105fa",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch",
                    "description": "Secure Launch configuration: 0 - Unmanaged, configurable by Administrative user, 1 - Enables Secure Launch if supported by hardware, 2 - Disables Secure Launch.",
                    "helpText": "",
                    "name": "ConfigureSystemGuardLaunch",
                    "displayName": "Configure System Guard Launch",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "8.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17763",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_0",
                            "description": "Unmanaged Configurable by Administrative user",
                            "helpText": null,
                            "name": "Unmanaged Configurable by Administrative user",
                            "displayName": "Unmanaged Configurable by Administrative user",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_1",
                            "description": "Unmanaged Enables Secure Launch if supported by hardware",
                            "helpText": null,
                            "name": "Unmanaged Enables Secure Launch if supported by hardware",
                            "displayName": "Unmanaged Enables Secure Launch if supported by hardware",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_2",
                            "description": "Unmanaged Disables Secure Launch",
                            "helpText": null,
                            "name": "Unmanaged Disables Secure Launch",
                            "displayName": "Unmanaged Disables Secure Launch",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Lsa Cfg Flags",
                        "Device Guard"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-deviceguard#lsacfgflags"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceGuard/LsaCfgFlags",
                    "rootDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
                    "categoryId": "992a8a1e-428e-41cb-948e-4e5da86105fa",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
                    "description": "Credential Guard Configuration: 0 - Turns off CredentialGuard remotely if configured previously without UEFI Lock, 1 - Turns on CredentialGuard with UEFI lock. 2 - Turns on CredentialGuard without UEFI lock.",
                    "helpText": "",
                    "name": "LsaCfgFlags",
                    "displayName": "Credential Guard",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_0",
                            "description": "(Disabled) Turns off Credential Guard remotely if configured previously without UEFI Lock.",
                            "helpText": null,
                            "name": "(Disabled) Turns off Credential Guard remotely if configured previously without UEFI Lock.",
                            "displayName": "(Disabled) Turns off Credential Guard remotely if configured previously without UEFI Lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
                            "description": "(Enabled with UEFI lock) Turns on Credential Guard with UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled with UEFI lock) Turns on Credential Guard with UEFI lock.",
                            "displayName": "(Enabled with UEFI lock) Turns on Credential Guard with UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_2",
                            "description": "(Enabled without lock) Turns on Credential Guard without UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled without lock) Turns on Credential Guard without UEFI lock.",
                            "displayName": "(Enabled without lock) Turns on Credential Guard without UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Enable Virtualization Based Security",
                        "Device Guard"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-deviceguard#enablevirtualizationbasedsecurity"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceGuard/EnableVirtualizationBasedSecurity",
                    "rootDefinitionId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity",
                    "categoryId": "992a8a1e-428e-41cb-948e-4e5da86105fa",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity",
                    "description": "Turns On Virtualization Based Security(VBS)",
                    "helpText": "",
                    "name": "EnableVirtualizationBasedSecurity",
                    "displayName": "Enable Virtualization Based Security",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity_0",
                            "description": "disable virtualization based security.",
                            "helpText": null,
                            "name": "disable virtualization based security.",
                            "displayName": "disable virtualization based security.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity_1",
                            "description": "enable virtualization based security.",
                            "helpText": null,
                            "name": "enable virtualization based security.",
                            "displayName": "enable virtualization based security.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Require Platform Security Features",
                        "Device Guard"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-deviceguard#requireplatformsecurityfeatures"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/DeviceGuard/RequirePlatformSecurityFeatures",
                    "rootDefinitionId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures",
                    "categoryId": "992a8a1e-428e-41cb-948e-4e5da86105fa",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures",
                    "description": "Select Platform Security Level: 1 - Turns on VBS with Secure Boot, 3 - Turns on VBS with Secure Boot and DMA. DMA requires hardware support.",
                    "helpText": "",
                    "name": "RequirePlatformSecurityFeatures",
                    "displayName": "Require Platform Security Features",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "6.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.16299",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_1",
                            "description": "Turns on VBS with Secure Boot.",
                            "helpText": null,
                            "name": "Turns on VBS with Secure Boot.",
                            "displayName": "Turns on VBS with Secure Boot.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_3",
                            "description": "Turns on VBS with Secure Boot and direct memory access (DMA). DMA requires hardware support.",
                            "helpText": null,
                            "name": "Turns on VBS with Secure Boot and direct memory access (DMA). DMA requires hardware support.",
                            "displayName": "Turns on VBS with Secure Boot and direct memory access (DMA). DMA requires hardware support.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Hypervisor Enforced Code Integrity",
                        "Virtualization Based Technology"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-VirtualizationBasedTechnology#hypervisorenforcedcodeintegrity"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/VirtualizationBasedTechnology/HypervisorEnforcedCodeIntegrity",
                    "rootDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                    "categoryId": "3588f84a-69de-4900-910c-09a5b69e5d99",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity",
                    "description": "Hypervisor-Protected Code Integrity: 0 - Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock, 1 - Turns on Hypervisor-Protected Code Integrity with UEFI lock, 2 - Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                    "helpText": "",
                    "name": "HypervisorEnforcedCodeIntegrity",
                    "displayName": "Hypervisor Enforced Code Integrity",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "11.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.22000",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_0",
                            "description": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "helpText": null,
                            "name": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "displayName": "(Disabled) Turns off Hypervisor-Protected Code Integrity remotely if configured previously without UEFI Lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_1",
                            "description": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "displayName": "(Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_2",
                            "description": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "helpText": null,
                            "name": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "displayName": "(Enabled without lock) Turns on Hypervisor-Protected Code Integrity without UEFI lock.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Require UEFI Memory Attributes Table",
                        "Virtualization Based Technology"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-VirtualizationBasedTechnology#requireuefimemoryattributestable"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/VirtualizationBasedTechnology/RequireUEFIMemoryAttributesTable",
                    "rootDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable",
                    "categoryId": "3588f84a-69de-4900-910c-09a5b69e5d99",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable",
                    "description": "Require UEFI Memory Attributes Table",
                    "helpText": "",
                    "name": "RequireUEFIMemoryAttributesTable",
                    "displayName": "Require UEFI Memory Attributes Table",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "11.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.22000",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable_0",
                            "description": "Do not require UEFI Memory Attributes Table",
                            "helpText": null,
                            "name": "Do not require UEFI Memory Attributes Table",
                            "displayName": "Do not require UEFI Memory Attributes Table",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable_1",
                            "description": "Require UEFI Memory Attributes Table",
                            "helpText": null,
                            "name": "Require UEFI Memory Attributes Table",
                            "displayName": "Require UEFI Memory Attributes Table",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}