{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('00570659-09e6-4ddd-8249-7078548701be')/settings(settingDefinitions())",
    "@odata.count": 27,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Logon Audit Credential Validation",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogon_auditcredentialvalidation"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogon_AuditCredentialValidation",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation",
                    "description": "This policy setting allows you to audit events generated by validation tests on user account logon credentials.  Events in this subcategory occur only on the computer that is authoritative for those credentials. For domain accounts, the domain controller is authoritative. For local accounts, the local computer is authoritative.",
                    "helpText": "",
                    "name": "AccountLogon_AuditCredentialValidation",
                    "displayName": "Account Logon Audit Credential Validation",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogon_auditcredentialvalidation_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Logon Logoff Audit Account Lockout",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditaccountlockout"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditAccountLockout",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout",
                    "description": "This policy setting allows you to audit events generated by a failed attempt to log on to an account that is locked out.  If you configure this policy setting, an audit event is generated when an account cannot log on to a computer because the account is locked out. Success audits record successful attempts and Failure audits record unsuccessful attempts.  Logon events are essential for understanding user activity and to detect potential attacks.",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditAccountLockout",
                    "displayName": "Account Logon Logoff Audit Account Lockout",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditaccountlockout_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Logon Logoff Audit Group Membership",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditgroupmembership"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditGroupMembership",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership",
                    "description": "This policy allows you to audit the group memberhsip information in the user's logon token. Events in this subcategory are generated on the computer on which a logon session is created. For an interactive logon, the security audit event is generated on the computer that the user logged on to. For a network logon, such as accessing a shared folder on the network, the security audit event is generated on the computer hosting the resource.  When this setting is configured, one or more security audit events are generated for each successful logon. You must also enable the Audit Logon setting under Advanced Audit Policy Configuration\\System Audit Policies\\Logon/Logoff. Multiple events are generated if the group memberhsip information cannot fit in a single security audit event.",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditGroupMembership",
                    "displayName": "Account Logon Logoff Audit Group Membership",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditgroupmembership_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Logon Logoff Audit Logoff",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditlogoff"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditLogoff",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff",
                    "description": "This policy setting allows you to audit events generated by the closing of a logon session. These events occur on the computer that was accessed. For an interactive logoff the security audit event is generated on the computer that the user account logged on to.  If you configure this policy setting, an audit event is generated when a logon session is closed. Success audits record successful attempts to close sessions and Failure audits record unsuccessful attempts to close sessions. If you do not configure this policy setting, no audit event is generated when a logon session is closed.",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditLogoff",
                    "displayName": "Account Logon Logoff Audit Logoff",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogoff_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Logon Logoff Audit Logon",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditlogon"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditLogon",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon",
                    "description": "This policy setting allows you to audit events generated by user account logon attempts on the computer. Events in this subcategory are related to the creation of logon sessions and occur on the computer which was accessed. For an interactive logon, the security audit event is generated on the computer that the user account logged on to. For a network logon, such as accessing a shared folder on the network, the security audit event is generated on the computer hosting the resource. The following events are included:     Successful logon attempts.     Failed logon attempts.     Logon attempts using explicit credentials. This event is generated when a process attempts to log on an account by explicitly specifying that account’s credentials. This most commonly occurs in batch logon configurations, such as scheduled tasks or when using the RUNAS command.     Security identifiers (SIDs) were filtered and not allowed to log on.",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditLogon",
                    "displayName": "Account Logon Logoff Audit Logon",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditlogon_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Account Management Audit Application Group Management",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountmanagement_auditapplicationgroupmanagement"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountManagement_AuditApplicationGroupManagement",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement",
                    "description": "This policy setting allows you to audit events generated by changes to application groups such as the following:     Application group is created, changed, or deleted.     Member is added or removed from an application group.  If you configure this policy setting, an audit event is generated when an attempt to change an application group is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when an application group changes.",
                    "helpText": "",
                    "name": "AccountManagement_AuditApplicationGroupManagement",
                    "displayName": "Account Management Audit Application Group Management",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditapplicationgroupmanagement_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "PolicyChange_AuditAuthenticationPolicyChange",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#policychange_auditauthenticationpolicychange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PolicyChange_AuditAuthenticationPolicyChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange",
                    "description": "This policy setting allows you to audit events generated by changes to the authentication policy such as the following:     Creation of forest and domain trusts.     Modification of forest and domain trusts.     Removal of forest and domain trusts.     Changes to Kerberos policy under Computer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Kerberos Policy.     Granting of any of the following user rights to a user or group:         Access This Computer From the Network.         Allow Logon Locally.         Allow Logon Through Terminal Services.         Logon as a Batch Job.         Logon a Service.     Namespace collision. For example, when a new trust has the same name as an existing namespace name.  If you configure this policy setting, an audit event is generated when an attempt to change the authentication policy is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when the authentication policy is changed.  Note: The security audit event is logged when the group policy is applied. It does not occur at the time when the settings are modified.",
                    "helpText": "",
                    "name": "PolicyChange_AuditAuthenticationPolicyChange",
                    "displayName": "Audit Authentication Policy Change",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthenticationpolicychange_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "PolicyChange_AuditAuthorizationPolicyChange",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#policychange_auditauthorizationpolicychange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PolicyChange_AuditAuthorizationPolicyChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange",
                    "description": "This policy setting allows you to audit events generated by changes to the authorization policy such as the following:     Assignment of user rights (privileges), such as SeCreateTokenPrivilege, that are not audited through the “Authentication Policy Change” subcategory.     Removal of user rights (privileges), such as SeCreateTokenPrivilege, that are not audited through the “Authentication Policy Change” subcategory.     Changes in the Encrypted File System (EFS) policy.     Changes to the Resource attributes of an object.     Changes to the Central Access Policy (CAP) applied to an object.  If you configure this policy setting, an audit event is generated when an attempt to change the authorization policy is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when the authorization policy changes.",
                    "helpText": "",
                    "name": "PolicyChange_AuditAuthorizationPolicyChange",
                    "displayName": "Audit Authorization Policy Change",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditauthorizationpolicychange_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "PolicyChange_AuditPolicyChange",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#policychange_auditpolicychange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PolicyChange_AuditPolicyChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange",
                    "description": "This policy setting allows you to audit changes in the security audit policy settings such as the following:     Settings permissions and audit settings on the Audit Policy object.     Changes to the system audit policy.     Registration of security event sources.     De-registration of security event sources.     Changes to the per-user audit settings.     Changes to the value of CrashOnAuditFail.     Changes to the system access control list on a file system or registry object.     Changes to the Special Groups list.  Note: System access control list (SACL) change auditing is done when a SACL for an object changes and the policy change category is enabled. Discretionary access control list (DACL) and ownership changes are audited when object access auditing is enabled and the object's SACL is configured for auditing of DACL/Owner change.",
                    "helpText": "",
                    "name": "PolicyChange_AuditPolicyChange",
                    "displayName": "Audit Changes to Audit Policy",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditpolicychange_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "ObjectAccess_AuditFileShare",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#objectaccess_auditfileshare"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/ObjectAccess_AuditFileShare",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare",
                    "description": "This policy setting allows you to audit attempts to access a shared folder.  If you configure this policy setting, an audit event is generated when an attempt is made to access a shared folder. If this policy setting is defined, the administrator can specify whether to audit only successes, only failures, or both successes and failures.  Note: There are no system access control lists (SACLs) for shared folders. If this policy setting is enabled, access to all shared folders on the system is audited.",
                    "helpText": "",
                    "name": "ObjectAccess_AuditFileShare",
                    "displayName": "Audit File Share Access",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditfileshare_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "AccountLogonLogoff_AuditOtherLogonLogoffEvents",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditotherlogonlogoffevents"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditOtherLogonLogoffEvents",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents",
                    "description": "This policy setting allows you to audit other logon/logoff-related events that are not covered in the “Logon/Logoff” policy setting such as the following:     Terminal Services session disconnections.     New Terminal Services sessions.     Locking and unlocking a workstation.     Invoking a screen saver.     Dismissal of a screen saver.     Detection of a Kerberos replay attack, in which a Kerberos request was received twice with identical information. This condition could be caused by network misconfiguration.     Access to a wireless network granted to a user or computer account.     Access to a wired 802.1x network granted to a user or computer account.",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditOtherLogonLogoffEvents",
                    "displayName": "Audit Other Logon Logoff Events",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditotherlogonlogoffevents_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "AccountManagement_AuditSecurityGroupManagement",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountmanagement_auditsecuritygroupmanagement"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountManagement_AuditSecurityGroupManagement",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement",
                    "description": "This policy setting allows you to audit events generated by changes to security groups such as the following:     Security group is created, changed, or deleted.     Member is added or removed from a security group.     Group type is changed.  If you configure this policy setting, an audit event is generated when an attempt to change a security group is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when a security group changes.",
                    "helpText": "",
                    "name": "AccountManagement_AuditSecurityGroupManagement",
                    "displayName": "Audit Security Group Management",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_auditsecuritygroupmanagement_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "12",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "System_AuditSecuritySystemExtension",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#system_auditsecuritysystemextension"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/System_AuditSecuritySystemExtension",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension",
                    "description": "This policy setting allows you to audit events related to security system extensions or services such as the following:     A security system extension, such as an authentication, notification, or security package is loaded and is registered with the Local Security Authority (LSA). It is used to authenticate logon attempts, submit logon requests, and any account or password changes. Examples of security system extensions are Kerberos and NTLM.     A service is installed and registered with the Service Control Manager. The audit log contains information about the service name, binary, type, start type, and service account. If you configure this policy setting, an audit event is generated when an attempt is made to load a security system extension. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when an attempt is made to load a security system extension.",
                    "helpText": "",
                    "name": "System_AuditSecuritySystemExtension",
                    "displayName": "Audit Security System Extension",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritysystemextension_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "13",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "AccountLogonLogoff_AuditSpecialLogon",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountlogonlogoff_auditspeciallogon"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountLogonLogoff_AuditSpecialLogon",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon",
                    "description": "This policy setting allows you to audit events generated by special logons such as the following :     The use of a special logon, which is a logon that has administrator-equivalent privileges and can be used to elevate a process to a higher level.     A logon by a member of a Special Group. Special Groups enable you to audit events generated when a member of a certain group has logged on to your network. You can configure a list of group security identifiers (SIDs) in the registry. If any of those SIDs are added to a token during logon and the subcategory is enabled, an event is logged. For more information about this feature, see article 947223 in the Microsoft Knowledge Base (https://go.microsoft.com/fwlink/?LinkId=121697).",
                    "helpText": "",
                    "name": "AccountLogonLogoff_AuditSpecialLogon",
                    "displayName": "Audit Special Logon",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountlogonlogoff_auditspeciallogon_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "14",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "AccountManagement_AuditUserAccountManagement",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#accountmanagement_audituseraccountmanagement"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/AccountManagement_AuditUserAccountManagement",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement",
                    "description": "This policy setting allows you to audit changes to user accounts. Events include the following:     A user account is created, changed, deleted; renamed, disabled, enabled, locked out, or unlocked.     A user account’s password is set or changed.     A security identifier (SID) is added to the SID History of a user account.     The Directory Services Restore Mode password is configured.     Permissions on administrative user accounts are changed.     Credential Manager credentials are backed up or restored.  If you configure this policy setting, an audit event is generated when an attempt to change a user account is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when a user account changes.",
                    "helpText": "",
                    "name": "AccountManagement_AuditUserAccountManagement",
                    "displayName": "Audit User Account Management",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_accountmanagement_audituseraccountmanagement_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "15",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Detailed Tracking Audit PNP Activity",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#detailedtracking_auditpnpactivity"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/DetailedTracking_AuditPNPActivity",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity",
                    "description": "This policy setting allows you to audit when plug and play detects an external device.  If you configure this policy setting, an audit event is generated whenever plug and play detects an external device. Only Success audits are recorded for this category. If you do not configure this policy setting, no audit event is generated when an external device is detected by plug and play.",
                    "helpText": "",
                    "name": "DetailedTracking_AuditPNPActivity",
                    "displayName": "Detailed Tracking Audit PNP Activity",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditpnpactivity_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "16",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Detailed Tracking Audit Process Creation",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#detailedtracking_auditprocesscreation"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/DetailedTracking_AuditProcessCreation",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation",
                    "description": "This policy setting allows you to audit events generated when a process is created or starts. The name of the application or user that created the process is also audited.  If you configure this policy setting, an audit event is generated when a process is created. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when a process is created.",
                    "helpText": "",
                    "name": "DetailedTracking_AuditProcessCreation",
                    "displayName": "Detailed Tracking Audit Process Creation",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_detailedtracking_auditprocesscreation_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "17",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Object Access Audit Detailed File Share",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#objectaccess_auditdetailedfileshare"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/ObjectAccess_AuditDetailedFileShare",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare",
                    "description": "This policy setting allows you to audit attempts to access files and folders on a shared folder. The Detailed File Share setting logs an event every time a file or folder is accessed, whereas the File Share setting only records one event for any connection established between a client and file share.  Detailed File Share audit events include detailed information about the permissions or other criteria used to grant or deny access.  If you configure this policy setting, an audit event is generated when an attempt is made to access a file or folder on a share. The administrator can specify whether to audit only successes, only failures, or both successes and failures.  Note: There are no system access control lists (SACLs) for shared folders. If this policy setting is enabled, access to all shared files and folders on the system is audited.",
                    "helpText": "",
                    "name": "ObjectAccess_AuditDetailedFileShare",
                    "displayName": "Object Access Audit Detailed File Share",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditdetailedfileshare_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "18",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Object Access Audit Other Object Access Events",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#objectaccess_auditotherobjectaccessevents"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/ObjectAccess_AuditOtherObjectAccessEvents",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents",
                    "description": "This policy setting allows you to audit events generated by the management of task scheduler jobs or COM+ objects.  For scheduler jobs, the following are audited:     Job created.     Job deleted.     Job enabled.     Job disabled.     Job updated. For COM+ objects, the following are audited:     Catalog object added.     Catalog object updated.     Catalog object deleted.",
                    "helpText": "",
                    "name": "ObjectAccess_AuditOtherObjectAccessEvents",
                    "displayName": "Object Access Audit Other Object Access Events",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditotherobjectaccessevents_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "19",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Object Access Audit Removable Storage",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#objectaccess_auditremovablestorage"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/ObjectAccess_AuditRemovableStorage",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage",
                    "description": "This policy setting allows you to audit user attempts to access file system objects on a removable storage device. A security audit event is generated only for all objects for all types of access requested.  If you configure this policy setting, an audit event is generated each time an account accesses a file system object on a removable storage. Success audits record successful attempts and Failure audits record unsuccessful attempts.  If you do not configure this policy setting, no audit event is generated when an account accesses a file system object on a removable storage.",
                    "helpText": "",
                    "name": "ObjectAccess_AuditRemovableStorage",
                    "displayName": "Object Access Audit Removable Storage",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_objectaccess_auditremovablestorage_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "20",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Policy Change Audit MPSSVC Rule Level Policy Change",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#policychange_auditmpssvcrulelevelpolicychange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PolicyChange_AuditMPSSVCRuleLevelPolicyChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange",
                    "description": "This policy setting allows you to audit events generated by changes in policy rules used by the Microsoft Protection Service (MPSSVC). This service is used by Windows Firewall. Events include the following:     Reporting of active policies when Windows Firewall service starts.     Changes to Windows Firewall rules.     Changes to Windows Firewall exception list.     Changes to Windows Firewall settings.     Rules ignored or not applied by Windows Firewall Service.     Changes to Windows Firewall Group Policy settings.  If you configure this policy setting, an audit event is generated by attempts to change policy rules used by the MPSSVC. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated by changes in policy rules used by the MPSSVC.",
                    "helpText": "",
                    "name": "PolicyChange_AuditMPSSVCRuleLevelPolicyChange",
                    "displayName": "Policy Change Audit MPSSVC Rule Level Policy Change",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditmpssvcrulelevelpolicychange_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "21",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_2",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Policy Change Audit Other Policy Change Events",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#policychange_auditotherpolicychangeevents"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PolicyChange_AuditOtherPolicyChangeEvents",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents",
                    "description": "This policy setting allows you to audit events generated by other security policy changes that are not audited in the policy change category, such as the following:     Trusted Platform Module (TPM) configuration changes.     Kernel-mode cryptographic self tests.     Cryptographic provider operations.     Cryptographic context operations or modifications.     Applied Central Access Policies (CAPs) changes.     Boot Configuration Data (BCD) modifications.",
                    "helpText": "",
                    "name": "PolicyChange_AuditOtherPolicyChangeEvents",
                    "displayName": "Policy Change Audit Other Policy Change Events",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_policychange_auditotherpolicychangeevents_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "22",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Privilege Use Audit Sensitive Privilege Use",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#privilegeuse_auditsensitiveprivilegeuse"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/PrivilegeUse_AuditSensitivePrivilegeUse",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse",
                    "description": "This policy setting allows you to audit events generated when sensitive privileges (user rights) are used such as the following:     A privileged service is called.     One of the following privileges are called:         Act as part of the operating system.         Back up files and directories.         Create a token object.         Debug programs.         Enable computer and user accounts to be trusted for delegation.         Generate security audits.         Impersonate a client after authentication.         Load and unload device drivers.         Manage auditing and security log.         Modify firmware environment values.         Replace a process-level token.         Restore files and directories.         Take ownership of files or other objects.  If you configure this policy setting, an audit event is generated when sensitive privilege requests are made. Success audits record successful requests and Failure audits record unsuccessful requests. If you do not configure this policy setting, no audit event is generated when sensitive privilege requests are made. ",
                    "helpText": "",
                    "name": "PrivilegeUse_AuditSensitivePrivilegeUse",
                    "displayName": "Privilege Use Audit Sensitive Privilege Use",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_privilegeuse_auditsensitiveprivilegeuse_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "23",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "System Audit I Psec Driver",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#system_auditipsecdriver"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/System_AuditIPsecDriver",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_system_auditipsecdriver",
                    "description": "This policy setting allows you to audit events generated by the IPsec filter driver such as the following:     Startup and shutdown of the IPsec services.     Network packets dropped due to integrity check failure.     Network packets dropped due to replay check failure.     Network packets dropped due to being in plaintext.     Network packets received with incorrect Security Parameter Index (SPI). This may indicate that either the network card is not working correctly or the driver needs to be updated.     Inability to process IPsec filters.  If you configure this policy setting, an audit event is generated on an IPsec filter driver operation. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated on an IPSec filter driver operation.",
                    "helpText": "",
                    "name": "System_AuditIPsecDriver",
                    "displayName": "System Audit I Psec Driver",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditipsecdriver_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "24",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "System Audit Other System Events",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#system_auditothersystemevents"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/System_AuditOtherSystemEvents",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_system_auditothersystemevents",
                    "description": "This policy setting allows you to audit any of the following events:     Startup and shutdown of the Windows Firewall service and driver.     Security policy processing by the Windows Firewall Service.     Cryptography key file and migration operations.",
                    "helpText": "",
                    "name": "System_AuditOtherSystemEvents",
                    "displayName": "System Audit Other System Events",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_3",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditothersystemevents_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "25",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_1",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "System Audit Security State Change",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#system_auditsecuritystatechange"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/System_AuditSecurityStateChange",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange",
                    "description": "This policy setting allows you to audit events generated by changes in the security state of the computer such as the following events:     Startup and shutdown of the computer.     Change of system time.     Recovering the system from CrashOnAuditFail, which is logged after a system restarts when the security event log is full and the CrashOnAuditFail registry entry is configured.",
                    "helpText": "",
                    "name": "System_AuditSecurityStateChange",
                    "displayName": "System Audit Security State Change",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_1",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsecuritystatechange_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "26",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_3",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "System Audit System Integrity",
                        "Audit",
                        "Auditing"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Audit#system_auditsystemintegrity"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/Audit/System_AuditSystemIntegrity",
                    "rootDefinitionId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity",
                    "categoryId": "5cb7f4f0-ef00-4eb3-80f4-2c2b97b053ea",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity",
                    "description": "This policy setting allows you to audit events that violate the integrity of the security subsystem, such as the following:     Events that could not be written to the event log because of a problem with the auditing system.     A process that uses a local procedure call (LPC) port that is not valid in an attempt to impersonate a client by replying, reading, or writing to or from a client address space.     The detection of a Remote Procedure Call (RPC) that compromises system integrity.     The detection of a hash value of an executable file that is not valid as determined by Code Integrity.     Cryptographic operations that compromise system integrity.",
                    "helpText": "",
                    "name": "System_AuditSystemIntegrity",
                    "displayName": "System Audit System Integrity",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_3",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "7.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17134.1039",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsEducation",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_0",
                            "description": "Off/None",
                            "helpText": null,
                            "name": "Off/None",
                            "displayName": "Off/ None",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_1",
                            "description": "Success",
                            "helpText": null,
                            "name": "Success",
                            "displayName": "Success",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_2",
                            "description": "Failure",
                            "helpText": null,
                            "name": "Failure",
                            "displayName": "Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_audit_system_auditsystemintegrity_3",
                            "description": "Success+Failure",
                            "helpText": null,
                            "name": "Success+Failure",
                            "displayName": "Success+ Failure",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 3
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}