{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('6c963798-5646-456c-b411-1ea9380a13da')/settings(settingDefinitions())",
    "@odata.count": 3,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_passportforwork_biometrics_usebiometrics",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_biometrics_usebiometrics_true",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Allow Use of Biometrics (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/Biometrics/UseBiometrics",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_biometrics_usebiometrics",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_biometrics_usebiometrics",
                    "description": "Windows Hello for Business enables users to use biometric gestures, such as face and fingerprints, as an alternative to the PIN gesture. However, users must still configure a PIN to use in case of failures.\n\nIf you enable or do not configure this policy setting, Windows Hello for Business allows the use of biometric gestures.\n\nIf you disable this policy setting, Windows Hello for Business prevents the use of biometric gestures.\n\nNOTE: Disabling this policy prevents the use of biometric gestures on the device for all account types.",
                    "helpText": "",
                    "name": "UseBiometrics",
                    "displayName": "Allow Use of Biometrics",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "False",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_biometrics_usebiometrics_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "True",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 0
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 6
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Require Security Device (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/RequireSecurityDevice",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                    "description": "A Trusted Platform Module (TPM) provides additional security benefits over software because data stored within it cannot be used on other devices.\n\nIf you enable this policy setting, only devices with a usable TPM provision Windows Hello for Business.\n\nIf you disable or do not configure this policy setting, the TPM is still preferred, but all devices provision Windows Hello for Business using software if the TPM is non-functional or unavailable.",
                    "helpText": "",
                    "name": "RequireSecurityDevice",
                    "displayName": "Require Security Device",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "false",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "true",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Maximum PIN Length (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/MaximumPINLength",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
                    "description": "Maximum PIN length configures the maximum number of characters allowed for the PIN.  The largest number you can configure for this policy setting is 127. The lowest number you can configure must be larger than the number configured in the Minimum PIN length policy setting or the number 4, whichever is greater.\n\nIf you configure this policy setting, the PIN length must be less than or equal to this number.\n\nIf you do not configure this policy setting, the PIN length must be less than or equal to 127.\n\nNOTE: If the above specified conditions for the maximum PIN length are not met, default values will be used for both the maximum and minimum PIN lengths.",
                    "helpText": "",
                    "name": "MaximumPINLength",
                    "displayName": "Maximum PIN Length",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 127,
                        "minimumValue": 4
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 127
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                            "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "History (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/History",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
                    "description": "This policy specifies the number of past PINs that can be stored in the history that can’t be used. Valid values are 0 to 50 inclusive. If this policy is set to 0, then storage of previous PINs is not required. PIN history is not preserved through PIN reset.",
                    "helpText": "",
                    "name": "History",
                    "displayName": "PIN History",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 50,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                            "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Special Characters (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/SpecialCharacters",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
                    "description": "Use this policy setting to configure the use of special characters in the Windows Hello for Business PIN gesture.  Valid special characters for Windows Hello for Business PIN gestures include: ! \" # $ % & ' ( ) * + , - . / : ; < = > ? @ [ \\ ] ^ _ ` { | } ~ .\n\nA value of 1 corresponds to “Required.” If you configure this policy setting to 1, Windows Hello for Business requires users to include at least one special character in their PIN.\n\nA value of 2 corresponds to “Disallow.” If you configure this policy setting to 2, Windows Hello for Business prevents users from using special characters in their PIN.\n\nIf you do not configure this policy setting, Windows Hello for Business does not allow users to use special characters in their PIN.",
                    "helpText": "",
                    "name": "SpecialCharacters",
                    "displayName": "Special Characters",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_2",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_0",
                            "description": "Allows the use of special characters in PIN.",
                            "helpText": null,
                            "name": "Allows the use of special characters in PIN.",
                            "displayName": "Allows the use of special characters in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_1",
                            "description": "Requires the use of at least one special characters in PIN.",
                            "helpText": null,
                            "name": "Requires the use of at least one special characters in PIN.",
                            "displayName": "Requires the use of at least one special characters in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_2",
                            "description": "Does not allow the use of special characters in PIN.",
                            "helpText": null,
                            "name": "Does not allow the use of special characters in PIN.",
                            "displayName": "Does not allow the use of special characters in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "TPM12",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/ExcludeSecurityDevices/TPM12",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12",
                    "description": "Some Trusted Platform Modules (TPMs) are only compliant with the older 1.2 revision of the TPM specification defined by the Trusted Computing Group (TCG).\n\nIf you enable this policy setting, TPM revision 1.2 modules will be disallowed from being used with Windows Hello for Business.\n\nIf you disable or do not configure this policy setting, TPM revision 1.2 modules will be allowed to be used with Windows Hello for Business.",
                    "helpText": "",
                    "name": "TPM12",
                    "displayName": "Restrict use of TPM 1.2",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.3",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.15063",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Use Passport For Work (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/UsePassportForWork",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                    "description": "Windows Hello for Business is an alternative method for signing into Windows using your Active Directory or Azure Active Directory account that can replace passwords, Smart Cards, and Virtual Smart Cards.\n\nIf you enable or do not configure this policy setting, the device provisions Windows Hello for Business for all users.\n\nIf you disable this policy setting, the device does not provision Windows Hello for Business for any user.",
                    "helpText": "",
                    "name": "UsePassportForWork",
                    "displayName": "Use Windows Hello For Business (Device)",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "false",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "true",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Use Certificate For On Prem Auth",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/UseCloudTrustForOnPremAuth",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth",
                    "description": "Windows Hello for Business to use Azure AD Kerberos to authenticate to on-premises resources. \n\nIf you enable this policy setting, Windows Hello for Business will use an Azure AD Kerberos ticket to authenticate to on-premises resources.\n\nIf you disable or do not configure this policy setting, Windows Hello for Business will use a key or certificate to authenticate to on-premises resources.",
                    "helpText": "",
                    "name": "UseCloudTrustForOnPremAuth",
                    "displayName": "Use Cloud Trust For On Prem Auth",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.6",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.19044.1566",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Uppercase Letters (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/UppercaseLetters",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
                    "description": "Use this policy setting to configure the use of uppercase letters in the Windows Hello for Business PIN.\n\nA value of 1 corresponds to “Required.” If you configure this policy setting to 1, Windows Hello for Business requires users to include at least one uppercase letter in their PIN.\n\nA value of 2 corresponds to “Disallow.” If you configure this policy setting to 2, Windows Hello for Business prevents users from using uppercase letters in their PIN.\n\nIf you do not configure this policy setting, Windows Hello for Business does not allow users to use uppercase letters in their PIN.",
                    "helpText": "",
                    "name": "UppercaseLetters",
                    "displayName": "Uppercase Letters",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_0",
                            "description": "Allows the use of uppercase letters in PIN.",
                            "helpText": null,
                            "name": "Allows the use of uppercase letters in PIN.",
                            "displayName": "Allowed",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_1",
                            "description": "Requires the use of at least one uppercase letters in PIN.",
                            "helpText": null,
                            "name": "Requires the use of at least one uppercase letters in PIN.",
                            "displayName": "Required",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_2",
                            "description": "Does not allow the use of uppercase letters in PIN.",
                            "helpText": null,
                            "name": "Does not allow the use of uppercase letters in PIN.",
                            "displayName": "Blocked",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Expiration (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/Expiration",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration",
                    "description": "This policy specifies when the PIN expires (in days). Valid values are 0 to 730 inclusive. If this policy is set to 0, then PINs do not expire.",
                    "helpText": "",
                    "name": "Expiration",
                    "displayName": "Expiration",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 730,
                        "minimumValue": 0
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 0
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                            "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Use Remote Passport",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/Remote/UseRemotePassport",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport",
                    "description": "Boolean that specifies if phone sign-in can be used with a device. Phone sign-in provides the ability for a portable, registered device to be usable as a companion device for desktop authentication.\n\nDefault value is false. If you enable this setting, a desktop device will allow a registered, companion device to be used as an authentication factor. If you disable this setting, a companion device cannot be used in desktop authentication scenarios.",
                    "helpText": "",
                    "name": "UseRemotePassport",
                    "displayName": "Use Remote Passport",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Minimum PIN Length (Device)",
                        "PassportForWork",
                        "Complexity",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/MinimumPINLength",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                    "description": "Minimum PIN length configures the minimum number of characters required for the PIN.  The lowest number you can configure for this policy setting is 4.  The largest number you can configure must be less than the number configured in the Maximum PIN length policy setting or the number 127, whichever is the lowest.\n\nIf you configure this policy setting, the PIN length must be greater than or equal to this number.\n\nIf you do not configure this policy setting, the PIN length must be greater than or equal to 4.\n\nNOTE: If the above specified conditions for the minimum PIN length are not met, default values will be used for both the maximum and minimum PIN lengths.",
                    "helpText": "",
                    "name": "MinimumPINLength",
                    "displayName": "Minimum PIN Length",
                    "version": "639094788176414916",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueDefinition",
                        "maximumValue": 127,
                        "minimumValue": 4
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 4
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                            "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                        }
                    ],
                    "dependedOnBy": []
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Use Certificate For On Prem Auth",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/UseCertificateForOnPremAuth",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                    "description": "Windows Hello for Business can use certificates to authenticate to on-premise resources. \n\nIf you enable this policy setting, Windows Hello for Business will wait until the device has received a certificate payload from the\u00A0mobile device management\u00A0server\u00A0before provisioning a PIN.\n\nIf you disable or do not configure this policy setting, the PIN will be provisioned when the user logs in, without waiting for a certificate payload.",
                    "helpText": "",
                    "name": "UseCertificateForOnPremAuth",
                    "displayName": "Use Certificate For On Prem Auth",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Use Hello Certificates As Smart Card Certificates",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/UseHelloCertificatesAsSmartCardCertificates",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates",
                    "description": "If you enable this policy setting, applications use Windows Hello for Business certificates as smart card certificates. Biometric factors are unavailable when a user is asked to authorize the use of the certificate's private key. This policy setting is designed to allow compatibility with applications that rely exclusively on smart card certificates.\n\nIf you disable or do not configure this policy setting, applications do not use Windows Hello for Business certificates as smart card certificates, and biometric factors are available when a user is asked to authorize the use of the certificate's private key.\n\nWindows requires a user to lock and unlock their session after changing this setting if the user is currently signed in.",
                    "helpText": "",
                    "name": "UseHelloCertificatesAsSmartCardCertificates",
                    "displayName": "Use Hello Certificates As Smart Card Certificates",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "1.6",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.17763",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Enable Pin Recovery (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/EnablePinRecovery",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                    "description": "If the user forgets their PIN, it can be changed to a new PIN using the Windows Hello for Business PIN recovery service. This cloud service encrypts a recovery secret which is stored locally on the client, but which can only be decrypted by the cloud service.\n\nIf you enable this policy setting, the PIN recovery secret will be stored on the device and the user will be able to change to a new PIN in case their PIN is forgotten.\n\nIf you disable or do not configure this policy setting, the PIN recovery secret will not be created or stored. If the user's PIN is forgotten, the only way to get a new PIN is by deleting the existing PIN and creating a new one, which will require the user to re-register with any services the old PIN provided access to.\n                ",
                    "helpText": "",
                    "name": "EnablePinRecovery",
                    "displayName": "Enable Pin Recovery",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.3",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.15063",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "false",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "true",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
                    "accessTypes": "add,delete,get",
                    "keywords": [
                        "Tenant Id (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}",
                    "description": "This policy specifies the Tenant ID in the format of a Globally Unique Identifier (GUID) without curly braces ( { , } ), which will be used as part of Windows Hello for Business provisioning and management.",
                    "helpText": "",
                    "name": "{TenantId}",
                    "displayName": "Device-scoped settings",
                    "version": "639094788176414916",
                    "childIds": [
                        "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_enablewindowshelloprovisioningforsecuritykeys",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_disablepostlogonprovisioning",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_disablepostlogoncredentialcaching",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport",
                        "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates"
                    ],
                    "maximumCount": 1,
                    "minimumCount": 0,
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 100
                    },
                    "referredSettingInformationList": [],
                    "dependentOn": [],
                    "dependedOnBy": [
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_excludesecuritydevices_tpm12",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_enablewindowshelloprovisioningforsecuritykeys",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_disablepostlogonprovisioning",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_disablepostlogoncredentialcaching",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_usecloudtrustforonpremauth",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_expiration",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_remote_useremotepassport",
                            "required": false
                        },
                        {
                            "dependedOnBy": "device_vendor_msft_passportforwork_{tenantid}_policies_usehellocertificatesassmartcardcertificates",
                            "required": false
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Digits",
                        "Passport For Work",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/Digits",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits",
                    "description": "Use this policy setting to configure the use of digits in the Windows Hello for Business PIN.\n\nA value of 1 corresponds to “Required.” If you configure this policy setting to 1, Windows Hello for Business requires users to include at least one digit in their PIN.\n\nA value of 2 corresponds to “Disallow.” If you configure this policy setting to 2, Windows Hello for Business prevents users from using digits in their PIN.\n\nIf you do not configure this policy setting, Windows Hello for Business requires users to use digits in their PIN.",
                    "helpText": "",
                    "name": "Digits",
                    "displayName": "Digits",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits_0",
                            "description": "Allows the use of digits in PIN.",
                            "helpText": null,
                            "name": "Allows the use of digits in PIN.",
                            "displayName": "Allows the use of digits in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits_1",
                            "description": "Requires the use of at least one digits in PIN.",
                            "helpText": null,
                            "name": "Requires the use of at least one digits in PIN.",
                            "displayName": "Requires the use of at least one digits in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_digits_2",
                            "description": "Does not allow the use of digits in PIN.",
                            "helpText": null,
                            "name": "Does not allow the use of digits in PIN.",
                            "displayName": "Does not allow the use of digits in PIN.",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Lowercase Letters (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/{0}/Policies/PINComplexity/LowercaseLetters",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
                    "description": "Use this policy setting to configure the use of lowercase letters in the Windows Hello for Business PIN.\n\nA value of 1 corresponds to “Required.” If you configure this policy setting to 1, Windows Hello for Business requires users to include at least one lowercase letter in their PIN.\n\nA value of 2 corresponds to “Disallow.” If you configure this policy setting to 2, Windows Hello for Business prevents users from using lowercase letters in their PIN.\n\nIf you do not configure this policy setting, Windows Hello for Business does not allow users to use lowercase letters in their PIN.",
                    "helpText": "",
                    "name": "LowercaseLetters",
                    "displayName": "Lowercase Letters",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_0",
                            "description": "Allows the use of lowercase letters in PIN.",
                            "helpText": null,
                            "name": "Allows the use of lowercase letters in PIN.",
                            "displayName": "Allowed",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_1",
                            "description": "Requires the use of at least one lowercase letters in PIN.",
                            "helpText": null,
                            "name": "Requires the use of at least one lowercase letters in PIN.",
                            "displayName": "Required",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_2",
                            "description": "Does not allow the use of lowercase letters in PIN.",
                            "helpText": null,
                            "name": "Does not allow the use of lowercase letters in PIN.",
                            "displayName": "Blocked",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 2
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_passportforwork_{tenantid}",
                                    "parentSettingId": "device_vendor_msft_passportforwork_{tenantid}"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_true",
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "add,delete,get,replace",
                    "keywords": [
                        "Facial Features Use Enhanced Anti Spoofing (Device)",
                        "PassportForWork",
                        "Windows Hello For Business"
                    ],
                    "infoUrls": [
                        "https://docs.microsoft.com/windows/client-management/mdm/PassportForWork-csp/"
                    ],
                    "baseUri": "./Device/Vendor/MSFT/PassportForWork",
                    "offsetUri": "/Biometrics/FacialFeaturesUseEnhancedAntiSpoofing",
                    "rootDefinitionId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
                    "categoryId": "e7ae2b99-0479-475f-af5c-96457121fcd0",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
                    "description": "This setting determines whether enhanced anti-spoofing is required for Windows Hello face authentication.\n\nIf you enable this setting, Windows requires all users on managed devices to use enhanced anti-spoofing for Windows Hello face authentication. This disables Windows Hello face authentication on devices that do not support enhanced anti-spoofing.\n\nIf you disable or do not configure this setting, Windows doesn't require enhanced anti-spoofing for Windows Hello face authentication.\n\nNote that enhanced anti-spoofing for Windows Hello face authentication is not required on unmanaged devices.",
                    "helpText": "",
                    "name": "FacialFeaturesUseEnhancedAntiSpoofing",
                    "displayName": "Facial Features Use Enhanced Anti Spoofing",
                    "version": "639094788176414916",
                    "defaultOptionId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_false",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm,configManager",
                        "configurationServiceProviderVersion": "1.2",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": "10.0.10586",
                        "windowsSkus": [
                            "windowsEnterprise",
                            "windowsProfessional",
                            "windowsHome",
                            "windowsEducation",
                            "holographicForBusiness",
                            "windowsMultiSession",
                            "iotEnterprise",
                            "windowsCloudN",
                            "windows11SE",
                            "iotEnterpriseSEval",
                            "windowsCPC"
                        ],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 0,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_false",
                            "description": "Disabled",
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "false",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "false"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_true",
                            "description": "Enabled",
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "true",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "true"
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}